Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: སྲས་པོ་དགའ་བྱེད་རིམ་གྲོ་ན་ཚོད་བཟང་། །
en: “Instiller of Joy will be his son and Excellent Youth his attendant.

source: ཟླ་བའི་འོད་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: The scholar will be Moonlight

source: སྦྱིན་པ་སྒྲོགས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Proclamation of Gifts the one of miracles.

source: འདུས་པ་དང་པོར་དགྲ་བཅོམ་པ་ཡི་ཚོགས། །བྱེ་བ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་དགུ་ཡོད། །
en: In his first congregation will gather “Nine hundred ninety billion worthy ones.

source: གཉིས་པར་བྱེ་བ་སྟོང་ཕྲག་དགུ་བཅུ་དྲུག །
en: In the second will be nine hundred sixty billion,

source: གསུམ་པར་བྱེ་བ་སྟོང་ཕྲག་དགུ་བཅུ་ལྔ། །
en: And in the third there will be nine hundred fifty billion.

source: རྒྱལ་བ་དེ་ཡི་སྐུ་ཚེའི་ལོ་གྲངས་ནི། །སྟོང་ཕྲག་བདུན་ཅུ་རྩ་གཉིས་དག་ཏུ་འགྱུར། །
en: The lifespan of this victor “Will be seventy-two thousand years,

source: དམ་པའི་ཆོས་ཀྱང་ལོ་གྲངས་བྱེ་བར་གནས། །
en: And the sacred Dharma will remain for ten million years.

source: སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཅིག་འབྱུང་བར་འགྱུར། །
en: His relics will manifest in a single stūpa.

source: དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་འབྱུང་གནས་ཀྱི། །སྐྱེ་ཡུལ་གྲོང་ཁྱེར་བཟང་པོ་ཞེས་ཀྱང་བྱ། །
en: The thus-gone Ratnākara “Will be born in the city called Excellence.

source: འོད་ཀྱི་ཚད་ནི་དཔག་ཚད་དྲུག་ཅུ་ཡོད། །
en: His light will extend sixty leagues.

source: སྨན་པ་ཡབ་ཡིན་ཡུམ་ནི་ཟླ་ཉི་བཟང་། །
en: Medicine will be his father, and Excellent Sun and Moon his mother.

source: རིན་ཆེན་མཆོག་མ་ཞེས་བྱ་སྲས་ཡིན་ལ། །
en: Supreme Jewel will be his son,

source: རིམ་གྲོ་པ་ནི་བློ་གྲོས་བཟང་པོ་ཡིན། །
en: “And Excellent Intelligence his attendant.

source: མཐོང་དགའ་མཁས་པ་ཟླ་བ་རྫུ་འཕྲུལ་ཅན། །
en: Joyous Sight will be the scholar And Moon the one of miracles.

source: དེ་ཡི་འདུས་པ་དང་པོར་ཁྲི་ཕྲག་གཅིག །གཉིས་པར་དྲུག་ཅུ་རྩ་དྲུག་གསུམ་པར་ནི། །དྲུག་ཅུ་ཐམ་པ་རྒྱལ་དེའི་སྐུ་ཚེའི་ཚད། །ལོ་གྲངས་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་ཡང་གཉིས། །
en: In his first congregation will be ten thousand, “In the second there will be sixty-six thousand, And in the third there will be sixty thousand. The lifespan of that victor Will be ninety-two thousand years,

source: ལྔ་འགྱུར་དུ་ནི་དམ་པའི་ཆོས་ཀྱང་གནས། །
en: “And the sacred Dharma will remain five times as long.

source: དེ་ཡི་སྐུ་གདུང་དག་ཀྱང་རྒྱས་འགྱུར་ཞིང་། །དེ་ནི་དཔལ་གྱིས་རྒྱས་པར་གྱུར་པ་སྟེ། །
en: His relics will be abundant, And as they gloriously increase,

source: རི་དགས་ཁྱུ་མཆོག་སེང་གེའི་སྟབས་གཤེགས་པ། །དེ་ཡི་སྐུ་གདུང་རྣམས་ལའང་མཆོད་པར་འགྱུར། །
en: The relics of the one who strode like the leader of the herd or a lion “Will receive offerings and worship.

source: སྟོན་པ་ལྷ་ཡི་མེ་ཏོག་སྐྱེ་བའི་ཡུལ། །གྲོང་ཁྱེར་མེ་ཏོག་གདུགས་ཞེས་བྱ་བ་ཡིན། །
en: The birthplace of the teacher Kusumadeva Will be the city known as Flower Parasol.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །
en: His family will be brahmin, and his light

source: དཔག་ཚད་ཉི་ཤུ་རྩ་གཉིས་བློ་བཟངས་ཡབ། །ཡུམ་ནི་པད་ལྡན་སྲས་པོ་སྐྱེ་དབང་ཡིན། །
en: “Will reach across twenty-two leagues. Excellent Mind will be his father and Lotus Possessor his mother. Ruler of Men will be his son

source: སྙིང་པོ་མཛོད་འཆང་རིམ་གྲོ་པ་ཡང་ཡིན། །
en: and Holder of the Essence Treasury will be his attendant.

source: ཟླ་མཆོག་སྐྱེ་བོས་མཆོད་འགྱུར་ཤེས་རབ་ཅན། །
en: Supreme Moon will be worshiped for his insight

source: ཟླ་འོད་ཅེས་བྱ་རྫུ་འཕྲུལ་ཅན་ཡང་ཡིན། །
en: “And Moonlight will be the one of miraculous abilities.

source: འདུས་པ་དང་པོར་བྱེ་བ་བརྒྱ་ཕྲག་གསུམ། །
en: In the first congregation there will be three billion,

source: གཉིས་པར་བྱེ་བ་བརྒྱ་ཕྲག་གཉིས་གསུམ་པར། །བྱེ་བ་ཕྲག་བརྒྱ་སྐུ་ཚེའི་ལོ་གྲངས་ནི། །ཁྲི་ཕྲག་སྟོང་ཡིན་སུམ་འགྱུར་དམ་ཆོས་གནས། །
en: In the second there will be two billion, And in third, one billion. “His lifespan will be ten million years and the sacred Dharma will remain thrice as long.

source: འདྲེན་པ་ཡི་ནི་མཆོད་རྟེན་གཅིག་འབྱུང་ལ། །དེ་ལ་གང་དག་སྐྱེས་པ་བུད་མེད་རྣམས། །བསྟོད་མཆོག་མཆོད་པ་རྒྱ་ཆེན་བྱེད་དེ་དག །བྱང་ཆུབ་མཆོག་རབ་ལ་ནི་རེག་པར་འགྱུར། །
en: There will be a single stūpa of this guide At which men and women Will offer supreme veneration and vast gifts, “Thereby reaching supreme awakening.

source: དེ་བཞིན་གཤེགས་པ་དོན་ལེགས་སེམས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་བསོད་ནམས་རབ་གསལ་ཡིན། །
en: The birthplace of the thus-gone Sucintitārtha Will be known as Bright Merit.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་གཉིས་བསོད་ནམས་བཟང་པོ་ཡབ། །དད་པ་ཅན་ཞེས་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: His family will be brahmin, “And his light will extend twenty-two leagues. Excellent Merit will be his father and Faithful his mother.

source: རྣམ་འཕྲུལ་སྲས་ཡིན་དགེ་བ་རིམ་གྲོ་པ། །
en: Miracle will be his son and Virtue his attendant.

source: རྒྱ་མཚོའི་མཛོད་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Ocean Treasury will be the scholar

source: བསོད་ནམས་སྟོབས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: “And Power of Merit the one with miraculous abilities.

source: འདུས་པ་དང་པོར་ཁྲི་ཕྲག་བཅུ་ཡོད་ལ། །གཉིས་པར་བརྒྱད་ཁྲི་གསུམ་པར་དྲུག་ཁྲི་ཡོད། །
en: In the first congregation there will be one hundred thousand, In the second there will be eighty thousand, and in the third there will be sixty thousand.

source: མི་རྣམས་དག་གི་ཚེ་ཚད་ལོ་གྲངས་ནི། །བརྒྱད་ཅུ་རྩ་བཞི་ཐམ་སྟེ་དེའི་ཡང་ཡིན། །
en: The lifespan of human beings “Will be eighty-four thousand years, and so will his.

source: དེ་ཡི་དམ་ཆོས་ལོ་གྲངས་སྟོང་ཕྲག་ནི། །དགུ་བཅུ་རྩ་གཉིས་བར་དུ་གནས་འགྱུར་ལ། །
en: His sacred Dharma will remain For ninety-two thousand years.

source: སྲིད་པ་མཐར་མཛད་གྲགས་པ་མཐའ་ཡས་དེའི། །སྐུ་གདུང་རྣམས་ཀྱང་རྒྱས་པ་དག་ཏུ་འགྱུར། །
en: This liberator from existence, endowed with infinite fame, “Will leave abundant relics.

source: དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་དབང་ཕྱུག་གི། །སྐྱེ་བའི་ཡུལ་ནི་བློ་ཡི་ཏོག་ཅེས་བྱ། །
en: The thus-gone Dharmeśvara Will be born in a place called Mind Crest.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅུ་ཡོད་ཡབ་ནི་ལེགས་བྱིན་ཡིན། །
en: His family will be brahmin, “And his light will extend ten leagues. Excellent Gift will be his father

source: མཁས་པའི་ང་རོ་ཞེས་བྱ་ཡུམ་ཡིན་ནོ། །
en: and Melody of Learning his mother.

source: བསོད་ནམས་ཅན་སྲས་ལེགས་དགའ་རིམ་གྲོ་པ། །
en: Endowed with Merit will be his son and Excellent Joy his attendant.

source: ཤེས་རབ་ཅན་གྱི་མཆོག་དང་རྫུ་འཕྲུལ་ཅན། །ཤིན་ཏུ་མཐོང་ཞེས་བྱ་བ་འབྱུང་བར་འགྱུར། །
en: The one with supreme insight and the one of miracles “Will both be called Vision.

source: ཚོགས་འདུས་དང་པོ་བྱེ་བ་སུམ་ཅུ་གཉིས། །གཉིས་པར་བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་གཅིག །གསུམ་པར་བྱེ་ཕྲག་སུམ་ཅུ་སྐུ་ཚེའི་ཚད། །
en: The first congregation will contain three hundred twenty million. In the second there will be two hundred ten million, And the third, three hundred million.

source: ལོ་གྲངས་སྟོང་ཕྲག་སུམ་ཅུ་རྩ་དྲུག་ཡིན། །
en: “His lifespan will be thirty-six thousand years,

source: གསུང་བའི་མཆོག་གི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་སྟོང་ཕྲག་བདུན་ཅུ་ཐམ་པར་གནས། །
en: And his supreme teachings of sacred Dharma Will remain for seventy thousand years.

source: རྒྱལ་བ་མཚན་དང་གཟི་བརྗིད་དཔལ་རྒྱས་པའི། །མཆོད་རྟེན་དག་ཀྱང་ཉི་ཤུ་རྩ་གཅིག་འབྱུང་། །
en: There will be twenty-one stūpas “Abounding with banners and splendid glory.

source: དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་གྲགས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་བསོད་ནམས་འོད་ཅེས་བྱ། །
en: The thus-gone Yaśomati Will be born at a place called Light of Merit.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །
en: The family of this victor will be brahmin,

source: དཔག་ཚད་གཉིས་ཡོད་ཡབ་ནི་ན་ཚོད་བཟང་། །དེ་ཡི་ཡུམ་ནི་གསེར་གྱི་ཕྲེང་ཞེས་བྱ། །
en: “And his light will extend two leagues. His father will be Excellent Youth and his mother Gold Garland.

source: སྲས་པོ་ལེགས་འབྱོར་བློ་ལྡན་རིམ་གྲོ་པ། །
en: Excellent Wealth will be his son and Intelligent his attendant.

source: ཚོགས་ཅན་རྒྱལ་པོ་མཁས་ཤིང་མཛངས་པ་སྟེ། །
en: The wise expert will be King of the Gathering

source: རྒྱལ་བས་བྱིན་པ་རྫུ་འཕྲུལ་ཅན་ཡང་ཡིན། །
en: “And Gift of the Victors will be the one with miraculous abilities.

source: ཚོགས་བདག་དམ་པའི་འདུས་པ་དང་པོ་ལ། །དགྲ་བཅོམ་སུམ་ཁྲི་གཉིས་པར་ཉི་ཁྲི་ཡོད། །གསུམ་པར་ཆིག་ཁྲི་སྐུ་ཚེ་ལོ་སྟོང་ཡིན། །
en: In the first congregation of this holy master of the gathering Will be thirty thousand worthy ones, In the second there will be twenty thousand, and in the third there will be ten thousand. “His lifespan will be a thousand years;

source: དམ་ཆོས་ལོ་གྲངས་བྱེ་བ་ཕྲག་གཉིས་གནས། །
en: His sacred Dharma will remain twenty million years.

source: ཡེ་ཤེས་འབྱུང་གནས་འཇིག་རྟེན་མཁྱེན་པ་པོ། །ཡོན་ཏན་ཐམས་ཅད་བསགས་པར་གྱུར་པ་དེའི། །སྐུ་གདུང་རྒྱས་པར་འགྱུར་ལ་མཆོད་རྟེན་ཡང་། །དྲུག་ཅུ་གཉིས་ཏེ་དེ་ནི་དེ་འདྲར་འགྱུར། །
en: The relics of this accumulator of all good qualities, The source of wisdom, the knower of the world, Will be abundant, and there will likewise be sixty-two stūpas.

source: མི་ཡི་མཆོག་མ་སྤོབས་པ་བརྩེགས་པ་ཡི། །སྐྱེ་ཡུལ་གྲོང་ཁྱེར་རྡུལ་བྲལ་ཅན་ཞེས་བྱ། །
en: “The supreme human, Pratibhānakūṭa, Will be born in the city called Immaculate.

source: རིགས་ནི་རྒྱལ་རིགས་ཆེན་པོ་འོད་ཀྱི་ཚད། །
en: He will be a member of a great kṣatriya family And his light will shine across sixty-two leagues.

source: དཔག་ཚད་དྲུག་ཅུ་རྩ་གཉིས་དད་དཔལ་ཡབ། །དགའ་མགུ་ཞེས་བྱ་ཡུམ་ཡིན་འབྱུང་མེད་སྲས། །གློག་དང་ལྡན་ཞེས་བྱ་བ་རིམ་གྲོ་པ། །
en: “Glorious Faith will be his father and Appreciation his mother. Nonoccurrence will be his son and Possessor of Lightning his attendant.

source: ཟླ་འོད་ཕ་རོལ་ཕྱིན་དེ་མཁས་པ་སྟེ། །
en: Perfect Moonlight will be the scholar

source: གོ་ཆ་སྲ་བརྟན་ཞེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And Solid Armor the one of miracles.

source: དྲང་སྲོང་ཚོགས་པ་འདུས་པ་དང་པོ་ལ། །བྱེ་ཁྲི་བརྒྱད་ཅུ་གཉིས་ཡོད་གཉིས་པར་ཡང་། །བྱེ་ཁྲི་བརྒྱད་ཅུ་གཅིག་ཡོད་གསུམ་པར་ནི། །བྱེ་ཁྲི་བརྒྱད་ཅུ་སྐུ་ཚེ་ལོ་དགུ་སྟོང་། །
en: “In the first congregation of that sage Will be eight hundred twenty billion; In the second there will be eight hundred ten billion; and in the third there will be eight hundred billion. His lifespan will be nine thousand years,

source: དེ་ཡི་སྐུ་གདུང་དག་ཀྱང་རྒྱས་འགྱུར་ལ། །གང་ཚེ་རྨི་ལམ་ན་ཡང་དྲན་བྱེད་གང་། །དེ་དག་ཐམས་ཅད་ཏིང་འཛིན་འདི་ཐོབ་འགྱུར།། །།
en: His relics will also be abundant, And even if someone just dreams of them They will attain this absorption.

source: མི་ཡི་སྐྱེས་མཆོག་རྡོ་རྗེ་རྒྱལ་མཚན་གྱི། །སྐྱེ་བའི་ཡུལ་ནི་གསེར་དང་ལྡན་ཞེས་བྱ། །
en: “The supreme human, Vajradhvaja, Will be born in a place known as Endowed with Gold.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དག་ཀྱང་། །སྐུ་ལས་དཔག་ཚད་དགུ་འབྱུང་ཟླ་ཉི་ཡབ། །ཡུམ་ནི་ཟླ་བཟངས་སྲས་པོ་མཐོང་དགའ་ཡིན། །
en: His family will be brahmin, And his light will extend nine leagues. “Sun and Moon will be his father and Excellent Moon his mother. Joyous Sight will be his son

source: ནོར་བུའི་འོད་ཟེར་ཞེས་བྱ་རིམ་གྲོ་པ། །མཐུ་ཆེན་འགྲོ་བའི་ང་རོ་ཤེས་རབ་ཅན། །སེམས་གནས་ཆོས་འཛིན་རྫུ་འཕྲུལ་ལྡན་པ་ཡིན། །
en: and Jewel Light his attendant. Melody of Powerful Movement will be endowed with insight And Abiding Mind That Holds the Dharma will possess miraculous abilities.

source: དེ་ཡི་འདུས་པ་དང་པོར་དགྲ་བཅོམ་པ། །ཁྲི་ཕྲག་སྟོང་པོ་བརྒྱ་ཕྲག་སུམ་ཅུ་དྲུག །གཉིས་པར་སུམ་ཅུ་བཞི་ཡོད་གསུམ་པར་ཡང་། །སུམ་ཅུ་གསུམ་ཡོད་རྒྱལ་བའི་ཚེ་ལོ་ཁྲི། །
en: “In his first congregation there will be Three billion six hundred million worthy ones; In the second there will be three billion four hundred million; In the third, three billion three hundred million; and the lifespan of this victor will be ten thousand years.

source: མི་ཡི་མཆོག་མའི་དམ་པའི་ཆོས་རྣམས་ཀྱང་། །ལོ་གྲངས་སུམ་སྟོང་ཆིག་བརྒྱའི་བར་དུ་གནས། །
en: “The sacred Dharma of this supreme human Will remain for three hundred thousand years.

source: འདྲེན་པ་ཡི་ནི་མཆོད་རྟེན་གཅིག་འབྱུང་ལ། །འོད་ཀྱིས་དཔག་ཚད་བཅུ་གསུམ་ཁྱབ་པར་འགྱུར། །
en: There will be a single stūpa of this guide, And its light will shine across thirteen leagues.

source: འཇིག་རྟེན་རྣམ་པར་འདྲེན་པ་ཕན་བཞེད་པའི། །སྐྱེ་བའི་ཡུལ་ནི་མཐོང་ན་དགའ་ཞེས་བྱ། །
en: “The guide of the world known as Hitaiṣin Will be born in a place called Delightful Sight.

source: དེ་བཞིན་གཤེགས་པའི་རིགས་ནི་བྲམ་ཟེ་ཡིན། །
en: The family of this thus-gone one will be brahmin,

source: འོད་ནི་དཔག་ཚད་གཉིས་ཡོད་ལག་བཟངས་ཡབ། །ཨུད་པལ་པད་མིག་ཡུམ་ཡིན་སྲས་པོ་ནི། །གཙུག་ན་རིན་ཆེན་གྲགས་ལྡན་རིམ་གྲོ་པ། །གསེར་མཆོག་གཟི་བརྗིད་ལྡན་པ་ཤེས་རབ་ཅན། །དགེ་སློང་སྤྲིན་འོད་རྫུ་འཕྲུལ་ལྡན་པ་ཡིན། །
en: His light will extend two leagues, and Excellent Hand will be his father. “Utpala Eye will be his mother, Jewel Crest will be his son, Endowed with Fame will be his attendant, Endowed with the Splendor of Supreme Gold will be the possessor of insight, And the monk, Luminous Clouds, will be endowed with miraculous abilities.

source: འདུས་པ་དང་པོར་ཉན་ཐོས་ཟག་མེད་རྣམས། །བྱེ་བ་ཕྲག་ནི་བཅྭ་བརྒྱད་སྙེད་ཅིག་འབྱུང་། །
en: “In the first congregation there will be One hundred eighty million undefiled hearers;

source: གཉིས་པར་དེ་སྙེད་གསུམ་པར་བྱེ་བ་ཕྲག །ཉི་ཤུ་ཚེ་ལོ་སྟོང་ཕྲག་བཅུ་གཉིས་ཡིན། །
en: In the second there will be just as many; and in the third, two hundred million. His lifespan will be twelve thousand years.

source: འདྲེན་པ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་ལྔ་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: “After that guide has attained nirvāṇa, His sacred Dharma will remain for fifty thousand years.

source: དེ་ཡི་སྐུ་གདུང་རྒྱས་འགྱུར་མཆོད་རྟེན་ཡང་། །བྱེ་བ་བརྒྱ་ཕྲག་བདུན་ཅུ་རྩ་བཞི་འབྱུང་། །
en: His relics will be abundant, And there will be seventy-four billion stūpas.

source: དེ་བཞིན་གཤེགས་པ་རྣམ་པར་རོལ་ལྡན་གྱི། །སྐྱེ་བའི་ཡུལ་ནི་ལྷ་ཡིས་མཆོད་ཅེས་བྱ། །
en: “The thus-gone Vikrīḍitāvin Will be born in a place called Worshiped by Gods.

source: རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་དྲ་བ་དག །དཔག་ཚད་བཅུ་བཞི་དེ་ཡབ་ལེགས་བཟངས་ཡིན། །དེ་ཡི་ཡུམ་ནི་ཡིད་འཕྲོག་མ་ཞེས་བྱ། །
en: His family will be kṣatriya and his net of light rays Will extend across fourteen leagues. “Exquisite Excellence will be his father and Ravishing his mother.

source: སྙན་པའི་བླ་མ་སྲས་ཡིན་རིམ་གྲོ་མཆོག །
en: Highest Fame will be his son and Supreme his attendant.

source: སྤྱོད་ལམ་ལྡན་ཞེས་བྱ་བ་ཤེས་རབ་ཅན། །
en: Endowed with Religious Conduct will be the one of insight

source: ནོར་བུའི་ཟླ་བ་ཞེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And Jewel Moon the one of miracles.

source: འདུས་པ་དང་པོར་དགེ་སློང་བསམ་གཏན་པ། །ཚོགས་པ་ལྔ་ཁྲི་འདུས་པ་གཉིས་པར་ཡང་། །དྲུག་ཁྲི་གསུམ་པར་དྲུག་ཁྲི་ལྔ་སྟོང་ཡོད། །
en: “In the first congregation there will be Fifty thousand monks inclined to meditation. In the second will be sixty thousand, And in the third sixty-five thousand.

source: མི་རྣམས་དག་གི་ཚེ་ལོ་ཉིས་སྟོང་ཡིན། །
en: “The lifespan of humans will be two thousand years,

source: དེ་བཞིན་གཤེགས་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་སྟོང་ཕྲག་བཅུ་གཅིག་ཚང་བར་གནས། །
en: And the thus-gone one’s sacred Dharma Will remain complete for eleven thousand years.

source: མྱ་ངན་འདས་པའི་མཆོད་རྟེན་གཅིག་ཡིན་ལ། །དཔག་ཚད་གསུམ་པའི་གདུགས་སྟོང་དག་གིས་ཁྱབ། །
en: There will be a single stūpa of suffering transcended, “Which will be adorned with a thousand parasols the size of three leagues.

source: དེ་བཞིན་གཤེགས་པ་མུན་དང་བྲལ་བ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་པད་མས་བརྒྱན་ཅེས་བྱ། །
en: The thus-gone Vigatatamas will be born In a place called Adorned with Lotuses.

source: རིགས་ནི་རྒྱལ་རིགས་འོད་ནི་དཔག་ཚད་བཅུ། །
en: His family will be kṣatriya and his light will extend ten leagues.

source: བསོད་ནམས་དགའ་ཡབ་ཡུམ་ནི་ཡོན་ཏན་འོད། །
en: “Merit Joy will be his father and Luminous Qualities his mother.

source: སྲས་ནི་ཟླ་བས་བྱིན་ཞེས་བྱ་བ་ཡིན། །
en: Moon Gift will be his son

source: རིམ་གྲོ་པ་ནི་དེས་པ་ཞེས་ཀྱང་བྱ། །
en: And Gentle his attendant.

source: ཟླ་བ་དགའ་ཞེས་བྱ་བ་ཤེས་རབ་ཅན། །
en: Moon Joy will be the one of insight

source: རིན་ཆེན་རྒྱལ་མཚན་ཞེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: “And Jewel Banner the one of miracles.

source: འདུས་པ་དང་པོར་ཉན་ཐོས་ཚོགས་པ་དག །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་གསུམ་གཉིས་པར། །ཉི་ཤུ་གཅིག་ཡོད་གསུམ་པར་ཉི་ཤུ་ཡོད། །
en: In the first gathering will be Two hundred thirty million hearers; in the second there will be Two hundred ten million; and in third, two hundred million.

source: སྐུ་ཚེ་ལོ་གྲངས་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ། །
en: “His lifespan will be twenty-five thousand years,

source: ཡོངས་སུ་མྱ་ངན་འདས་ནས་ཆོས་ཚུལ་དག །ལོ་གྲངས་སྟོང་ཕྲག་ལྔ་བཅུ་ཚང་བར་གནས། །
en: And after his attaining nirvāṇa the Dharma teachings Will remain complete for fifty thousand years.

source: དེ་ཡི་སྐུ་གདུང་རྣམས་ནི་རྒྱས་འགྱུར་ལ། །
en: His relics will be abundant,

source: མཆོད་རྟེན་བྱེ་བ་བརྒྱ་ཕྲག་དགུ་བཅུ་བཞི། །
en: “And there will be nine hundred forty million stūpas.

source: རྒྱལ་བ་སྒྲ་གཅན་ལྷ་ཞེས་བྱ་བ་ཡི། །སྐྱེ་ཡུལ་བཟང་པོའི་འབྱུང་གནས་ཞེས་ཀྱང་བྱ། །
en: The victorious Rāhudeva will be born In a place known as Source of Excellence.

source: དེའི་རིགས་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །
en: His family will be brahmin,

source: དཔག་ཚད་ཕྱེད་དང་གསུམ་ཡོད་གྲགས་བཟང་ཡབ། །སྐལ་ལྡན་འདོད་མ་དེ་བཞིན་གཤེགས་པའི་ཡུམ། །
en: “And his light will extend three and half leagues. Excellent Fame will be his father and Fortunate Wish his mother.

source: རིན་ཆེན་འོད་ཅེས་བྱ་བ་སྲས་ཡིན་ནོ། །
en: Jewel Light will be his son

source: མཐའ་ཡས་གཟུགས་ཞེས་བྱ་བ་རིམ་གྲོ་པ། །
en: And Infinite Form his attendant.

source: སྟོབས་བརྩོན་ཞེས་ནི་བྱ་བ་ཤེས་རབ་ཅན། །
en: “Diligent Strength will be the one of insight

source: ཟླ་བའི་ཞལ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Moon Countenance the one of miracles.

source: དེ་ཡི་འདུས་པ་དང་པོར་དགྲ་བཅོམ་ཚོགས། །བྱེ་བ་ཚང་བར་ཡོད་དེ་གཉིས་པར་ཡང་། །བྱེ་བ་ཕྲག་དྲུག་གསུམ་པར་བྱེ་ཕྲག་ལྔ། །
en: In the first congregation there will be ten million worthy ones, In the second there will be sixty million, and in the third there will be fifty million.

source: སྐུ་ཚེ་ལོ་གྲངས་སྟོང་ཕྲག་བརྒྱད་ཅུ་ཡིན། །
en: “His lifespan will be eighty thousand years,

source: གཞན་ཡང་དམ་ཆོས་ཕལ་ཆེན་ཕྱིར་ཞིང་གནས། །
en: And his sacred Dharma will flourish for long.

source: འདྲེན་པ་ཡི་ནི་མཆོད་རྟེན་གཅིག་འབྱུང་ལ། །
en: There will be a single stūpa of this guide,

source: དཔག་ཚད་གཅིག་པའི་གདུགས་ནི་ལྔ་བརྒྱས་ཁྱབ། །
en: Adorned with five hundred parasols the size of a league.

source: ཆོས་ཀྱི་རྒྱལ་པོ་རི་བོའི་རྒྱལ་མཚན་གྱི། །སྐྱེ་བའི་ཡུལ་ནི་རྒྱལ་བ་ཅན་ཞེས་བྱ། །
en: “The king of Dharma, Merudhvaja, Will be born in a place called Victorious.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་སྐུ་ཡི་འོད། །རྒྱང་གྲགས་གཉིས་ཡོད་གཟི་བཟངས་ཡབ་ཡིན་ལ། །བདེ་བའི་འོད་ཅེས་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: His family will be kṣatriya, And his light will extend two krośas. “Excellent Splendor will be his father and Light of Bliss his mother.

source: ཆོས་བཟངས་སྲས་ཡིན་སང་གྷིལ་རིམ་གྲོ་པ། །
en: Dharma Excellence will be his son and Saṅgila his attendant.

source: སྤྱོད་པའི་འོད་ཅེས་བྱ་བ་ཤེས་རབ་ཅན། །
en: Luminous Conduct will be the one of insight

source: མྱ་ངན་མེད་དཔལ་ཞེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And Glorious Freedom from Suffering will be the one of miracles.

source: འདུས་པ་དང་པོར་བྱེ་བ་བརྒྱ་ཕྲག་བཅུ། །གཉིས་པར་དགུ་ཡོད་གསུམ་པར་བྱེ་བ་བརྒྱད། །
en: “In the first congregation there will be one hundred billion, In the second there will be ninety billion, and in the third there will be eighty million.

source: དེ་ཡི་ཚེ་ན་སྐྱེས་པ་བུད་མེད་ཀྱི། །ཚེ་ལོ་སྟོང་ཕྲག་ཉི་ཤུ་རྩ་ཡང་གཉིས། །
en: The lifespan of men and women Will be twenty-two thousand years.

source: འཇིག་རྟེན་རྣམ་འདྲེན་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་པའི་ཆོས་ནི་ལོ་གྲངས་བྱེ་བར་གནས། །
en: “When this guide of the world has attained nirvāṇa His sacred Dharma will remain for ten million years.

source: སྐུ་གདུང་རིན་ཆེན་བདག་ཉིད་རིལ་པོ་གཅིག །མཆོད་རྟེན་གཅིག་ལ་སྣ་ཚོགས་གདུགས་སྟོང་ཡོད། །
en: His precious relics will remain together Within a single stūpa adorned with one thousand different parasols.

source: བདེ་བར་གཤེགས་པ་ཚོགས་ཅན་འོད་སྐྱེ་བའི། །ཡུལ་ནི་ཡུལ་འཁོར་བདེ་དང་ལྡན་ཞེས་བྱ། །
en: “The well-gone Gaṇiprabha Will be born in a place known as Land of Happiness.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །
en: His family will be kṣatriya and his light Will extend across thirty leagues.

source: དཔག་ཚད་སུམ་ཅུ་ལེགས་པའི་ལྷ་ནི་ཡབ། །དགའ་བྱེད་གཟི་བརྗིད་ཡུམ་ཡིན་སྔོ་སངས་སྲས། །ལེགས་སེམས་གྲགས་པ་ཞེས་བྱ་རིམ་གྲོ་པ། །
en: “God of Excellence will be his father, Splendid Enjoyment his mother, Bright Blue his son, and Fame of Excellent Mind his attendant.

source: ང་རོ་ཡོད་པ་དེ་ནི་མཁས་པ་སྟེ། །
en: Possessor of the Roar will be the one of insight

source: རིགས་པར་དགའ་བ་རྫུ་འཕྲུལ་ཅན་ཡིན་ནོ། །
en: And Delighting in Reasoning the one of miracles.

source: འདུས་པ་དང་པོར་དགྲ་བཅོམ་བྱེ་བ་བརྒྱ། །གཉིས་པར་དགུ་བཅུ་གསུམ་པར་བརྒྱད་ཅུ་ཡོད། །
en: “In the first congregation there will be one billion worthy ones, In the second there will be nine hundred million, and in the third there will be eight hundred million.

source: དེ་ཚེ་མི་རྣམས་དག་གི་ཚེ་ལོའི་ཚད། །ལོ་གྲངས་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་ཡིན། །
en: At that time the lifespan of humans Will be eighty-four thousand years.

source: དེ་བཞིན་གཤེགས་པ་མྱ་ངན་འདས་ནས་ཆོས། །ལོ་གྲངས་བྱེ་ཕྲག་གསུམ་དུ་འཇིག་མི་འགྱུར། །
en: “When that thus-gone one has attained nirvāṇa The Dharma will remain intact for thirty million years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ཀྱང་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་བྱེ་བ་ཕྲག་ནི་དྲུག་ཅུ་ཐམ། །
en: The relics of that victorious one will be abundant And there will be six hundred million stūpas.

source: དེ་བཞིན་གཤེགས་མཆོག་རིན་ཆེན་སྙིང་པོ་ཡི། །སྐྱེ་ཡུལ་ཟླ་བ་མེ་ཏོག་བཟང་ཞེས་བྱ། །
en: “The thus-gone Ratnagarbha Will be born in a place called Moon of Excellent Flowers.

source: དེ་ཡི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅུ་གཉིས་ཡོད་དེ་ལྷུན་བཟངས་ཡབ། །དེ་ཡི་ཡུམ་ནི་ཟླ་དཔལ་མ་ཞེས་བྱ། །
en: His family will be kṣatriya, And his light will extend twelve leagues. “Fine Mountain will be his father and Glorious Moon his mother.

source: གསེར་འོད་སྲས་ཡིན་རྒྱ་མཚོ་རིམ་གྲོ་པ། །
en: Golden Light will be his son and Ocean his attendant.

source: སེང་གེའི་སྟོབས་ཞེས་བྱ་བ་ཤེས་རབ་ཅན། །
en: Lion Strength will be the one of insight

source: དེ་ཡི་འདུས་པ་དང་པོར་ཉན་ཐོས་གྲངས། །ཁྲི་ཕྲག་སྟོང་པོ་བརྒྱད་ཅུ་གཉིས་པར་ཡང་། །དེ་སྙེད་གསུམ་པར་ཁྲི་སྟོང་དགུ་བཅུ་དྲུག ། དེ་འོག་དགེ་སློང་ཚོགས་ནི་བསམ་མི་ཁྱབ། །
en: “In the first congregation there will be eight hundred million hearers; In the second there will be same amount; And in the third there will be nine hundred sixty million. Beyond that there will be an inconceivable amount of hearers.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་གྲངས་བརྒྱད་ཁྲི་ཡིན། །
en: “His lifespan will be eighty thousand years,

source: དམ་ཆོས་ལོ་གྲངས་བདུན་ཁྲི་ཐམ་པར་གནས། །
en: And the sacred Dharma will remain for seventy thousand years.

source: དེ་ཡི་སྐུ་གདུང་དག་ཀྱང་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་བྱེ་བ་གདུགས་སྟོང་དག་གིས་ཁྱབ། །
en: His relics will be abundant, And there will be ten million stūpas adorned with thousands of parasols.

source: དེ་བཞིན་གཤེགས་པ་ཤིན་ཏུ་མཐོར་གཤེགས་ཀྱི། །སྐྱེ་བའི་ཡུལ་ནི་མཆོག་ཏུ་བཟང་ཞེས་བྱ། །
en: “The thus-gone Atyuccagāmin will be born In a place called Supreme Excellence.

source: རིགས་ནི་བྲམ་ཟེ་དཔག་ཚད་དྲུག་པའི་འོད། །ཀུན་ཏུ་ཁྱབ་པ་ཡབ་ནི་ལེགས་ཡིད་གཞུངས། །དེའི་ཡུམ་བསོད་ནམས་ལྡན་ཡིན་སྲས་པོ་ནི། །མུ་སྟེགས་བཟང་པོ་སྟོབས་ཅན་རིམ་གྲོ་པ། །
en: His family will be brahmin and his light Will pervade across six leagues. “Fine and Noble Mind will be his father and Meritorious his mother. Excellent Steps will be his son and Powerful his attendant.

source: ལེགས་པར་སེམས་ཞེས་བྱ་བ་ཤེས་རབ་ཅན། །
en: Excellent Attention will be the one of insight

source: ཁ་ལོ་སྒྱུར་དགའ་ཞེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And Joyous Leader the one of miracles.

source: འདུས་པ་དང་པོར་དགྲ་བཅོམ་བྱེ་བ་ཕྲག །དགུ་བཅུ་རྩ་བཞི་གཉིས་པར་བྱེ་བ་གསུམ། །གསུམ་པར་ཚོགས་པ་བྱེ་བ་བརྒྱད་ཅུ་ཐམ། །
en: “In the first congregation there will be Nine hundred forty million worthy ones, In the second there will be thirty million, And in the third there will be eight hundred million.

source: མི་རྣམས་དག་གི་ཚེ་ཚད་ལོ་སྟོང་ཡིན། །
en: “The lifespan of humans will be a thousand years,

source: མྱ་ངན་འདས་ནས་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་སྟོང་ཕྲག་དྲུག་ཅུ་ཐམ་པར་གནས། །
en: And upon attaining nirvāṇa The sacred Dharma will remain for sixty thousand years.

source: དཔག་ཚད་གཉིས་པའི་མཆོད་རྟེན་གཅིག་འབྱུང་ལ། །གདུགས་ནི་བྱེ་བ་དག་གིས་ཀུན་ཏུ་ཁྱབ། །
en: There will be a single stūpa measuring two leagues “And adorned with ten million parasols.

source: མི་ཡི་མཆོག་མ་བདག་པོ་སྐར་རྒྱལ་གྱི། །སྐྱེ་བའི་ཡུལ་ནི་རིན་ཆེན་སྒྲོན་ཞེས་བྱ། །
en: The supreme human, Tiṣya, Will be born in a place called Jewel Lamp.

source: དེ་བཞིན་གཤེགས་པའི་རིགས་ནི་རྒྱལ་རིགས་འོད། །དཔག་ཚད་བརྒྱད་ཡོད་ཡབ་ནི་མུ་སྟེགས་བཟང་། །གཟུགས་བཟང་ཡུམ་ཡིན་སྲས་ནི་དྲང་སྲོང་ཡིན། །
en: The thus-gone one’s family will be kṣatriya “And his light will extend eight leagues. Excellent Steps will be his father, Excellent Form his mother, and Sage his son.
